<?php

return [
    /*-------------------------------------------------------------------------
    | Telegram steps
    |--------------------------------------------------------------------------
    |
    | Here you may specify your steps.
    |
    */
    'steps' => [
        'personal' => [
            // приватные сообщение
        ],
        'channel' => [
            // сообщение в канале
        ],
    ],

    /*-------------------------------------------------------------------------
    | Process user
    |--------------------------------------------------------------------------
    |
    | todo
    |
    */
    'process_user_callback' => function ($telegram_id, $name) {
        return null;
    },

    /*-------------------------------------------------------------------------
    | Process channel access
    |--------------------------------------------------------------------------
    |
    | todo
    |
    */
    'channel_access_callback' => function ($telegram_id) {
        return null;
    },

    /**
     * Показывать пользователю событие "бот печатает..."
     */
    'action_typing' => true
];
